app/views/profiles/index.html.erb

SELECT `profiles`.* FROM `profiles`
SELECT 1 AS one FROM `profiles` WHERE `profiles`.`user_id` = 6 LIMIT 1
---

<% unless current_user.profiles.any? %>