app/controllers/job_responses_controller.rb

SELECT `job_responses`.* FROM `job_responses` WHERE `job_responses`.`job_post_id` = '2' ORDER BY updated_at DESC
---
  def index
    @job_responses = @job_post.job_responses.order("updated_at DESC")

SELECT `job_responses`.* FROM `job_responses` WHERE `job_responses`.`id` = 2 LIMIT 1
---
  def show
    @job_response = JobResponse.find(params[:id])

INSERT INTO `job_responses` (`job_post_id`, `email`, `response`, `resume`, `created_at`, `updated_at`, `user_id`, `fullname`) VALUES ('1', NULL, 'i want this job', 'link', '2024-05-07 20:19:40.382989', '2024-05-07 20:19:40.382989', 7, 'trang nguyen')
---
  def create
    @job_response = @job_post.job_responses.new(job_response_params)
    @job_response.job_post = @job_post
    @job_response.user = current_user

    respond_to do |format|
      if @job_response.save

SELECT `job_responses`.* FROM `job_responses` WHERE `job_responses`.`id` = 3 LIMIT 1
DELETE FROM `job_responses` WHERE `job_responses`.`id` = 3
---
  def destroy
    @job_response = JobResponse.find(params[:id])
    @job_response.destroy