app/controllers/job_posts_controller.rb

SELECT `job_posts`.* FROM `job_posts` ORDER BY `job_posts`.`updated_at` DESC
---
  def index
    set_tab :all_posts
    @job_posts = JobPost.order(updated_at: :desc)

SELECT `job_posts`.* FROM `job_posts` WHERE `job_posts`.`id` = 1 LIMIT 1
---
  def show
    @job_post = JobPost.find(params[:id])

SELECT `job_posts`.* FROM `job_posts` WHERE `job_posts`.`id` = 4 LIMIT 1
---
  def edit
    @job_post = JobPost.find(params[:id])

INSERT INTO `job_posts` (`title`, `company`, `description`, `created_at`, `updated_at`, `user_id`) VALUES ('Student', 'Kenyon', 'studying', '2024-05-07 19:22:26.374928', '2024-05-07 19:22:26.374928', 6)
---
  def create
    @job_post = current_user.job_posts.build(job_post_params)

    respond_to do |format|
      if @job_post.save

SELECT `job_posts`.* FROM `job_posts` WHERE `job_posts`.`id` = 1 LIMIT 1
UPDATE `job_posts` SET `job_posts`.`description` = 'hhhhhhaa', `job_posts`.`updated_at` = '2024-05-07 19:38:14.968632' WHERE `job_posts`.`id` = 2
---
  def update
    @job_post = JobPost.find(params[:id])

    respond_to do |format|
      if @job_post.update(job_post_params)

SELECT `job_posts`.* FROM `job_posts` WHERE `job_posts`.`id` = 5 LIMIT 1
DELETE FROM `job_posts` WHERE `job_posts`.`id` = 5
---
  def destroy
    @job_post = JobPost.find(params[:id])
    @job_post.destroy