app/controllers/profiles_controller.rb

  def index
    @profiles = Profile.all
---
SELECT `profiles`.* FROM `profiles`

  def create
    #@profile = Profile.new(profile_params)
    @profile = current_user.profiles.build(profile_params)

    respond_to do |format|
      if @profile.save
---
INSERT INTO `profiles` (`first_name`, `last_name`, `email`, `phone`, `company`, `created_at`, `updated_at`, `user_id`) VALUES ('Trang', 'Nguyen', 'thutrangcsp@gmail.com', '7402335119', 'Kenyon College', '2024-05-09 19:34:47.436525', '2024-05-09 19:34:47.436525', 6)

  def destroy
    @profile.destroy!
---
DELETE FROM `profiles` WHERE `profiles`.`id` = 12

    def set_profile
      @profile = Profile.find(params[:id])
---
SELECT `profiles`.* FROM `profiles` WHERE `profiles`.`id` = 12 LIMIT 1